const leftList = [{
  id: '0',
  title: '图书',
  url: 'book'
}, {
  id: '1',
  title: '童书',
  url: 'children_book',
}, {
  id: '2',
  title: '电子书',
  url: 'e_book'
}]

const rightList = [
  {
    id: '0',
    title: '图书',
    banner: 'http://img63.ddimg.cn/upload_img/00803/1/886x315_0612-1565944394.jpg',
    list: [{
      id: '0_0',
      title: '社会'
    }, {
      id: '0_1',
      title: '历史'
    }]
  },
  {
    id: '1',
    title: '童书',
    banner: 'http://img62.ddimg.cn/upload_img/00785/ts0813_0819/886x315_dl_0809-1565603610.jpg',
    list: [{
      id: '1_0',
      title: '童话'
    }, {
      id: '1_1',
      title: '少儿英语'
    }]
  },
  {
    id: '2',
    title: '电子书',
    banner: 'http://img62.ddimg.cn/ddreader/dangebook/8y3rd_886x315.jpg',
    list: [{
      id: '2_0',
      title: '经济'
    }, {
      id: '2_1',
      title: '管理'
    }]
  }
]

const contentList = [
  {
    id: '0_0',
    title: '图书-》社会',
    list: [
      {
        "id": "25090502",
        "name": "平凡的世界：全三册（朱一龙推荐，八年级下册自主阅读推荐）",
        "subname": "新晋男神朱一龙推荐阅读。茅盾文学奖皇冠上的明珠，激励亿万读者的不朽经典。深受老师和学生喜爱的新课标必读书",
        "authorname": "路遥 著，新经典 出品",
        "image_url": "http:\/\/img3m2.ddimg.cn\/41\/25\/25090502-1_h_5.jpg",
      }, {
        "id": "24156030",
        "name": "长安十二时辰（上下册）",
        "subname": "易烊千玺、雷佳音领衔主演同名影视剧正在播出！作家马伯庸长篇代表作，突破真实与虚构界限，打造令人窒息的历史悬疑巨制，揭秘不为人知的十二时辰。",
        "authorname": "马伯庸 著,博集天卷 出品",
        "image_url": "http:\/\/img3m0.ddimg.cn\/30\/25\/24156030-1_h_12.jpg",
      }, {
        "id": "25170989",
        "name": "苏菲的世界（新版）",
        "subname": "二十世纪百部经典名著之一 全球销量超过4500万册",
        "authorname": "乔斯坦·贾德",
        "image_url": "http:\/\/img3m9.ddimg.cn\/41\/0\/25170989-1_h_5.jpg",
      }, {
        "id": "25137790",
        "name": "活着（2017年新版）",
        "subname": "余华是我国当代著名作家，也是享誉世界的小说家，曾荣获众多国内外奖项。《活着》是其代表作，在全球广泛传播，销量逾千万册，获得了普遍好评，已成为中国乃至世界当代文学的经典。",
        "authorname": "余华",
        "image_url": "http:\/\/img3m0.ddimg.cn\/7\/27\/25137790-1_h_4.jpg",
      }, {
        "id": "23761145",
        "name": "人间失格（日本小说家太宰治的自传体小说，李现推荐）",
        "subname": "超燃！“丧文化”流行，《人间失格》成了现象级畅销书，创当当3天销售50000+册的奇迹！收录作者绝笔之作《Good bye》。一个“丧失为人资格”少年的心灵独白，一个对村上春树影响至深的绝望凄美故事。",
        "authorname": "(日)太宰治 著，杨伟 译",
        "image_url": "http:\/\/img3m5.ddimg.cn\/56\/4\/23761145-1_h_6.jpg",
      }
    ]
  },
  {
    id: '0_1',
    title: '图书-》历史',
    list: [
      {
        "id": "25119332",
        "name": "东野圭吾：白夜行（易烊千玺、邓伦推荐，东野圭吾作品无冕之王）",
        "subname": "我一直走在白夜里，从来就没有太阳，所以不怕失去。中文版发行量超600万册。",
        "authorname": "(日)东野圭吾 著，新经典 出品",
        "image_url": "http:\/\/img3m2.ddimg.cn\/62\/32\/25119332-1_h_9.jpg",
      }, {
        "id": "23464478",
        "name": "东野圭吾：解忧杂货店（胡歌、王俊凯、刘昊然倾情推荐，东野圭吾长篇小说代表作，这家店帮你找回内心流失的东西）",
        "subname": "易中天、王安忆盛。畅销天王东野圭吾长篇小说代表作，登顶北大图书馆预约榜，5年销量超900万册，豆瓣40万人点评8.5高分，创造出版奇迹！",
        "authorname": "(日)东野圭吾 著，新经典 出品",
        "image_url": "http:\/\/img3m8.ddimg.cn\/92\/3\/23464478-1_h_7.jpg",
      }, {
        "id": "25126128",
        "name": "月亮和六便士（全新导读无删节详注版！ 半年创当当110000名读者五星好评奇迹）看“一本好书”，在当当享阅读之趣",
        "subname": "口碑爆棚的现象级畅销书！毛姆研究专家苏福忠译作，当当书香节一天狂销10000+！历史销量名列同名书前列！村上春树连读两遍，张爱玲感动推荐。知乎网友惊叹“可惜我不是在十几岁读的这本书” 。",
        "authorname": "〔英〕毛姆 著 苏福忠 译",
        "image_url": "http:\/\/img3m8.ddimg.cn\/27\/20\/25126128-1_h_2.jpg",
      }, {
        "id": "23694647",
        "name": "摆渡人（系列畅销千万册。如果命运是一条孤独的河流，谁会是你灵魂的摆渡人？《摆渡人》完结篇即将上市！）",
        "subname": "（《青春有你》王喆推荐！畅销欧美33个国家，荣获多项图书大奖。令千万读者灵魂震颤的人性救赎之作。如果我真的存在，也是因为你需要我。白马时光）",
        "authorname": "(英)克莱儿·麦克福尔，白马时光 出品",
        "image_url": "http:\/\/img3m7.ddimg.cn\/86\/32\/23694647-1_h_8.jpg",
      }
    ]
  },
  {
    id: '1_0',
    title: '童书-》童话',
    list: [
    ]
  },
  {
    id: '1_1',
    title: '童书-》少儿英语',
    list: [
    ]
  },
  {
    id: '2_0',
    title: '电子书-》经济',
    list: [
    ]
  },
  {
    id: '2_1',
    title: '电子书-》管理',
    list: [
    ]
  }
]

module.exports = {
  leftList,
  rightList,
  contentList,
}